<a href="https://colab.research.google.com/github/sooonsyk/ESAA/blob/main/Week2_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**파이썬 머신러닝 완벽 가이드 p. 39 ~ 86**

##**데이터 핸들링 - 판다스**
###**판다스**
- 행과 열로 이루어진 2차원 데이터를 효율적으로 가공/처리할 수 있는 기능 제공
- 파이썬의 리스트, 컬렉션, 넘파이 등의 내부 데이터뿐만 아니라 CSV등의 파일을 쉽게 Dataframe으로 변경해 데이터의 가공/분석을 편리하게 수행할 수 있게 만들어줌
- Dataframe : 판다스의 핵심 객체, 여러개의 행과 열로 이루어진 2차원 데이터를 담는 데이터 구조체
  - Index : 개별 데이터를 고유하게 식별하는 key
  - Series : 칼럼이 하나뿐인 데이터 구조체
  - Series와 Dataframe 모두 Index를 key 값으로 가짐
  - Dataframe은 여러개의 Series로 이루어졌다고 할 수 있음

###**판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API**

```
import pandas as pd
```
- 판다스는 다양한 포맷으로 된 파일을 DataFrame으로 로딩할 수 있는 편리한 API 제공
  - read_csv() : CSV(칼럼을 ','으로 구분한 파일 포맷) 파일 포맷 변환을 위한 API
  - read_table() : 필드 구분 문자(delimeter)가 '\t'
  - read_fwf() : fixed width 즉 고정 길이 기반의 칼럼 포맷을 위한 API
  - 구분문자는 sep 옵션을 통해 설정 가능
  - 로드하려는 데이터 파일의 경로를 포함하는 파일명을 입력하면 파이썬 실행 파일이 있는 디렉터리와 동일한 디렉터리에 있는 파일명을 로딩함

In [1]:
import pandas as pd

In [ ]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/train.csv')
print('titanic 변수 type : ', type(titanic_df))
titanic_df

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- pd.read_csv() : 호출 시 파일명 인자로 들어온 파일을 로딩해 DataFrame 객체로 반환
  - 별다른 파라미터 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 인지하고 칼럼으로 변환함
  - 파일에 기재돼 잇지 않는 데이터값이 로우 순으로 0,1,2,3....과 같이 순차적으로 표시돼 있음 - 판다스의 index 값
    - 모든 DataFrame내의 데이터는 생성되는 순간 고유의 Index값을 가짐

- DataFrame.head() : DataFrame의 맨 앞에 잇는 N개의 로우 반환, default 5개

In [ ]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- DataFrame.shape : DataFrame의 행과 열의 튜플로 반환

In [ ]:
print('DataFrame 크기 : ', titanic_df.shape)

DataFrame 크기 :  (891, 12)

- DataFrame.info() : 총 데이터 건수와 데이터 타입, Null 건 수 알 수 있음

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- DataFrame.describe() : 칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값을 나타냄, 오직 숫자형(int,float 등) 칼럼의 분포도만 조사하며 자동으로 object 타입의 칼럼은 출력에서 제외시킴
  - count : not null인 데이터 건수
  - mean : 전체 데이터 값의 평균
  - std : 표준편차
  - min : 최솟값
  - max : 최댓값
  - 해당 숫자 칼럼이 숫자형 카테고리 칼럼(특정 번주에 속하는 값을 코드화한 칼럼)인지를 판단할 수 있게 도와줌

In [ ]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- DataFrame의 [ ] 연산자 내부에 칼럼며을 입력하면 Series 형태로 특정 칼럼 데이터 세트가 반환됨
- Series : Index와 단 하나의 칼럼으로 구성된 데이터 세트
- value_counts() : 이렇게 반환된 Series 객체에 호출하면 해당 칼럼값의 유형과 건수를 확인할 수 있음, 지정된 칼럼의 데이터값 건수 반환
  - 많은 건수 순서로 정렬되어 값을 반환
  - DataFrame은 가지지 않음
  - 반환하는 값 역시 Series 객체
- 인덱스는 단순히 순차 값과 같은 의미 없는 식별자만 할당하는 것이 아니라 고유성이 보장된다면 의미 있는 데이터값 할당도 가능
  - value_counts()는 칼럼 값별 데이터 건수를 반환하므로 고유 칼럼 값을 식별자로 사용할 수 있음
  - 인덱스는 후에 변경 가능, 숫자형뿐만 아니라 문자열도 가능, 단, 모든 인덱스는 고유성이 보장돼야 함

In [ ]:
titanic_pclass = titanic_df['Pclass']
type(titanic_pclass)

pandas.core.series.Series

In [ ]:
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [ ]:
type(titanic_pclass.value_counts())

pandas.core.series.Series

###**DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환**
- 기본적으로 DataFrame은 파이썬의 리스트, 딕셔너리, 그리고 넘파이 ndarray등 다양한 데이터로부터 생성될 수 있음, 또 반대로 변환될 수도 있음
####**넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기**
- DataFrame은 리스트와 넘파이 ndarray와 다르게 칼럼명을 가지므로 리스트와 넘파이 ndarray보다 상대적으로 편하게 데이터 핸들링 가능
  - 일반적으로 DataFrame으로 변환 시 칼럼명을 지정해줌( 지정하지 않으면 자동으로 할당)
- 판다스 DataFrame 객체의 생성 인자 data는 리스트나 딕셔너리 또는 넘파이 ndarray를 입력 받고, 생성 인자 colums는 칼럼명 리스트를 입력 받아 DataFrame 생성
  - DataFrame은 기본적으로 행과 열을 가지는 2차원 데이터 이므로 2차원 이하의 데이터들만 DataFrame으로 변환될 수 있음

In [ ]:
#1차원 형태의 list, 넘파이 ndarray 변환
import numpy as np

col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array1 shape : ', array1.shape)

#리스트 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns = col_name1)
print('1차원 리스트로 만든 DataFrame : \n', df_list1)

#넘파이 ndarray 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns = col_name1)
print('1차원 ndarray로 만든 DataFrame :\n', df_array1)

array1 shape :  (3,)
1차원 리스트로 만든 DataFrame :
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame :
    col1
0     1
1     2
2     3

In [ ]:
#2차원 형태(2,3)의 데이터 변환

col_name2 = ['col1','col2','col3'] # 칼럼 3개니까 칼럼명 3개 필요
list2 = [[1,2,3],
         [11,12,13]]
array2 = np.array(list2)
print('array2 shape : ', array2.shape)
df_list2 = pd.DataFrame(list2, columns = col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
df_array2 = pd.DataFrame(array2, columns = col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

array2 shape :  (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [ ]:
#딕셔너리 변환 : 일반적으로 key를 칼럼명으로 value를 키에 해당하는 칼럼 데이터로

dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

####**DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기**

In [ ]:
#DataFrame을 ndarray로 변환 - DataFrame 객체의 values를 이용해 쉽게 가능

array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape: ', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape:  (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [ ]:
#DataFrame을 리스트로 변환 - values로 얻은 ndarray에 tolist() 호출
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
list3

df_dict.values.tolist() 타입: <class 'list'>

[[1, 2, 3], [11, 22, 33]]

In [ ]:
#DataFrame을 딕셔너리로 변환 - DataFrame 객체의 to_dict() 메서드 호출
dict3 = df_dict.to_dict('list') # 인자로 'list'를 입력하면 딕셔너리의 값이 리스트형으로 반환됨
print('\n df_dict.to_dict() 타입 : ', type(dict3))
dict3

 df_dict.to_dict() 타입 :  <class 'dict'>

{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

####**DataFrame의 칼럼 데이터 세트 생성과 수정**
- DataFrame의 칼럼 데이터 세트 생성과 수정 역시 [ ] 연산자를 이용해 쉽게 할 수 있음

In [ ]:
titanic_df['Age_0'] = 0  #새로운 칼럼 Age_0 추가하고 일괄적으로 0 할당
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [ ]:
#기존 칼럼 Series의 데이터를 이용해 새로운 칼럼 Series 만듦
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [ ]:
#기존 칼럼 업데이트
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

####**DataFrame 데이터 삭제**
- drop() : labels에 원하는 칼럼명을 입력하고 axis=1을 입력하면 지정된 칼럼을 드롭
  - axis 값에 따라서 특정 칼럼 또는 특정 행 드롭 - axis0 ↓ : 로우 방향 축, axis1 → : 칼럼 방향 축
  - Inplace : 디폴트가 False로 자기 자신의 DataFrame의 데이터는 삭제하지 않고 삭제된 결과 Df를 반환, True로 설정하면 반환값이 None이 되므로 반환 값을 다시 자신의 DataFrame객체로 할당하면 안 됨
  - 여러 개의 칼럼을 삭제하고 싶르면 리스트 형태로 삭제하고자 하는 칼럼 명을 입력해 label 파라미터로 입력

In [ ]:
#Age_0 칼럼 삭제
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [ ]:
drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'], axis=1, inplace=True)
print('inplace=True 로 drop 후 반환된 값: ', drop_result)
titanic_df.head(3)

inplace=True 로 drop 후 반환된 값:  None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

####**Index 객체**
- DataFrame, Series의 레코드를 고유하게 식별하는 객체
- DataFrame.index, Series.index 속성으로 통해 Index 객체만 추출 가능
- Series 객체는 Index 객체를 포함하지만 Series 객체에 연산 함수를 적용할 때 Index는 연산에서 제외됨, Index는 오직 식별용
- reset_index() : 새롭게 인덱스를 연속 숫자 형으로 할당하고 기존 인덱스는 'index'라는 새로운 칼럼 명으로 추가함
  - 인덱스가 연속된 int 숫자형 데이터가 아닐 경우에 다시 이를 연속 int 숫자형 데이터로 만들 때 주로 사용
  - Series에 reset_index()를 적용하면 Series가 아닌 DataFrame이 반환됨 - 기존 인덱스가 칼럼으로 추가돼 칼럼이 2개가 되므로
  - drop=True로 설정하면 기존 인덱스는 새로운 칼럼으로 추가되지 않고 삭제되고 Series로 유지됨

In [3]:
#원본 파일 다시 로딩
titanic_df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/train.csv')

#index 객체 추출
indexes = titanic_df.index
print('Index 객체 : ',indexes)
#index 객체를 실제 값 array로 변환 - 넘파이 1차원 ndarray로 볼 수 있음
print('Index 객체 array 값:\n', indexes.values)

Index 객체 :  RangeIndex(start=0, stop=891, step=1)
Index 객체 array 값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [39]:
# ndarray와 유사하게 단일 값 반환 및 슬라이싱도 가능
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [40]:
#한 번 만들어진 DataFrame 및 Series의 Index 객체는 함부로 변경할 수 없음
indexes[0] = 5

TypeError: ignored

In [42]:
series_fair = titanic_df['Fare']
print('Fair Series max 값 : ', series_fair.max())
print('Fair Series sum 값 : ', series_fair.sum())
print('sum() Fair Series :', sum(series_fair))
print('Fair Series + 3:\n', (series_fair+3).head(3))

Fair Series max 값 :  512.3292
Fair Series sum 값 :  28693.9493
sum() Fair Series : 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [41]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [43]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)

print('### after reset_index ###')
print(new_value_counts)
print('new_value_counts 객체 변수 타입 : ', type(new_value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>
### after reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입 :  <class 'pandas.core.frame.DataFrame'>

###**데이터 셀렉션 및 필터링**
- 넘파이와 유사하지만 다른 부분도 있어 혼동하기 쉬움
- 넘파이의 경우 '[ ]'내 단일 값 추출, 슬라이싱, 팬시 인덱싱, 불린 인덱싱으로 통해 데이터를 추출했음, 판다스의 경우 ix[ ], iloc[ ], loc[ ] 연산자를 통해 동일한 작업 수행
####**DataFrame의 [ ]연산자**
- 넘파이에서 [ ]연산자는 행의 위치, 열의 위치, 슬라이싱 범위 등을 지정해 데이터를 가지고 올 수 있었음
- DataFrame 바로 뒤에 있는 [ ]안에 들어갈 수 있는 것은 칼럼 명 문자(또는 칼럼 명의 리스트 객체), 또는 인덱스로 변환 가능한 표현식임 - **칼럼 지정 연산자로 이해**
  - 슬라이싱 지양하는 것이 좋음

In [4]:
print('단일 칼럼 데이터 추출 : \n', titanic_df['Pclass'].head(3))
print('\n여러 칼럼의 데이터 추출 : \n', titanic_df[['Survived','Pclass']].head(3))
print('[]안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])
#[ ]에는 칼럼명을 지정해야하는데 0은 칼럼명이 아니기 때문에 오류 발생

단일 칼럼 데이터 추출 :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 칼럼의 데이터 추출 :
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: ignored

In [5]:
titanic_df[0:2]
# 숫자값을 입력할 경우 오류가 남 그러나 판다스의 인덱스 형태로 변환 가능한 표현식은 [ ]내에 입력 가능

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [6]:
titanic_df[titanic_df['Pclass']==3].head(3)
#불린 인덱싱 표현도 가능

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

####**DataFrame ix[ ] 연산자**
-ix[0,Pclass] : 행 위치 지정으로 인덱스값 0, 열 위치 지정으로 칼럼 명 입력해 원하는 위치의 데이터 추출할 수 있음
  - 행에 해당하는 위치 지정은 DataFrame의 인덱스값 입력해야함
  - 열 위치 지정은 칼럼명(칼럼 명칭 기반 인덱싱) 뿐만 아니라 칼럼의 위치 값 지정(칼럼 위치 기반 인덱싱)도 가능함
  
  => 현재 사라짐, 칼럼 명칭 기반 인덱싱인 loc[ ]와 칼럼 위치 기반 인덱싱인 iloc[ ] 새로 만들어짐

In [7]:
print('칼럼 위치 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0,2])
print('칼럼 명 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0,'Pclass'])

AttributeError: ignored

####**명칭 기반 인덱싱과 위치 기반 인덱싱의 구분**
- 명칭 기반 인덱싱 : 칼럼의 명칭을 기반으로 위치를 지정하는 방식
- 위치 기반 인덱싱 : 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 행과 열 위치를 기반으로 데이터 지정, 행,열 값으로 정수가 입력됨

=> DataFrame의 인덱스값은 명칭 기반 인덱싱으로 간주

####**DataFrame iloc[ ]연산자**
- iloc[ ]: 위치 기반 인덱싱만 허용하기 때문에 행과 열 값으로 int 혹은 int형의 슬라이싱, 팬시 리스트 값을 입력해줘야 함
  - 슬라이싱과 팬시 인덱싱은 제공하다 명확한 위치 기반 인덱싱이 사용되어야 하는 제약으로 인해 불린 인덱싱은 제공하지 않음

In [8]:
data = {'Name':['Chulmin','Eunkyung','JinWoong','Soobeom'],
        'Year':[2011,2016,2015,2015],
        'Gender':['Male','Female','Male','Male']
        }
data_df = pd.DataFrame(data, index = ['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  JinWoong  2015    Male
four    Soobeom  2015    Male

In [10]:
data_df.iloc[0,0]

'Chulmin'

In [9]:
data_df.iloc[0,'Name']
# 위치 인덱싱이 아닌 명칭을 입력하면 오류 발생

KeyError: ignored

In [13]:
data_df_reset = data_df.reset_index()  #data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df_reset.rename(columns = {'index':'old_index'})
data_df_reset

  old_index      Name  Year  Gender
0       one   Chulmin  2011    Male
1       two  Eunkyung  2016  Female
2     three  JinWoong  2015    Male
3      four   Soobeom  2015    Male

In [12]:
data_df_reset.iloc[0,1]

'Chulmin'

####**DataFrame loc[ ] 연산자**
- loc[ ] : 명칭 기반으로 데이터를 추출, 행 위치에는 DataFrame index값 열 위치에는 칼럼 명을 입력해줌
  - index가 숫자 형일 수 있기 때문에 명칭 기반이라고 무조건 문자열을 입력한다는 선입견 가져선 안 됨
  - loc[ ]에 슬라이싱 기호를 적용하면 시작값 ~ 종료값-1 이 아니라 시작값 ~ 종료값임 - 명칭 기반 인덱스 특성상 명칭이 숫자형이 아닐 수 있기 때문에 -1 못함

In [14]:
data_df.loc['one','Name']

'Chulmin'

In [16]:
data_df_reset.index = data_df_reset.index + 1  #인덱스 값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  JinWoong  2015    Male
4      four   Soobeom  2015    Male

In [17]:
data_df_reset.loc[1,'Name']

'Chulmin'

In [18]:
data_df_reset.loc[0,'Name']
#인덱스 값이 0인 행이 없으므로 오류를 반환

KeyError: ignored

In [19]:
print('명칭 기반 loc slicing\n', data_df.loc['one':'two', 'Name'], '\n') #2개 행 반환
print('위치 기반 iloc slicing\n', data_df.iloc[0:1,0]) # 1개 행 반환

명칭 기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

위치 기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

In [20]:
print(data_df_reset.loc[1:2, 'Name']) # 1:2 는 인덱스값에 다른 명칭 기반 인덱싱이므로 2개 행 반환

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

####**불린 인덱싱**
- '[ ]' 연산자 내에 불린 조건 입력
- '[ ]' 내에 불린 인덱싱을 적용하면 반환되는 객체가 DataFrame이므로 원하는 칼럼 명만 별도로 추출할 수 있음
  - and 조건일 때는 &
  - or 조건일 때는 |
  - Not 조건일 때는 ~

In [21]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [22]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)  #칼럼이 2개 이상이므로 [[]] 사용

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [23]:
titanic_df.loc[titanic_df['Age']>60, ['Name','Age']].head(3)  #loc[]으로 동일하게 가능 단, ['Name','Age']이 칼럼 위치에 놓임

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [24]:
titanic_df[(titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [ ]:
cond1 = titanic_df['Age']>60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[cond1 & cond2 & cond3]  # 개별 조건을 변수에 할당하고 이들 변수를 결합해서 수행해도 동일한 결과

###**정렬, Aggregation 함수, GroupBy 적용**
####**DataFrame, Series의 정렬 - sort_values()**
- by로 특정 칼럼을 입력하면 해당 칼럼으로 정렬 수행, ascending=True 가 디폴트로 오름차순으로 정렬함, inplace=False가 디폴트로 sort_values()를 호출한 DataFrame은 그대로 유지하며 정렬된 DataFrame을 반환

In [25]:
titanic_sorted = titanic_df.sort_values(by = ['Name'])
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [27]:
titanic_sorted = titanic_df.sort_values(by = ['Pclass','Name'],ascending=False)
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S

####**Aggregation 함수 적용**
- DataFrame 에서 바로 aggregation을 호출할 경우 모든 칼럼에 해당 aggregation을 적용
- 특정 칼럼에만 적용하기 위해서는 DataFrame에 대상 칼럼들만 추철해 aggregation 적용
- min(), max(),sum(),count(),,

In [28]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [29]:
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

####**groupby() 적용**
- 입력 파라미터 by에 칼럼을 입력하면 대상 칼럼으로 groupby됨
- DataFrame에 groupby()를 호출하면 DataFrameGroupBy라는 또 다른 형태의 DataFrame 반환
- DataFrame에 groupby()를 호출해 반환된 결과에 aggregation 함수를 호출하면 groupby() 대상 칼럼을 제외한 모든 칼럼에 해당 aggregation 함수를 적용함
- 서로 다른 함수 적용할 경우 함수명을 DataFrameGroupBy 객체의 agg() 내에 인자로 입력해서 사용
- 여러 개의 칼럼이 서로 다른 aggregation함수를 groupby에서 호출하려면 agg() 내에 입력값으로 딕셔너리 형태로 aggregation이 적용될 칼럼들과 aggregation 함수를 입력

In [30]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [31]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [32]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [33]:
titanic_df.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [34]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

###**결손 데이터 처리하기**
- 결손 데이터 : 칼럼에 값이 없는, 즉 NULL인 경우 의미하며 이를 넘파이의 NaN으로 표시
  - 머신러닝 알고리즘 이 NaN 값을 처리하지 않으므로 이 값을 다른 값으로 대체해야 함
  - NaN 값은 평균, 총합 등의 함수 연산 시 제외됨
  
####**isna()로 결손 데이터 여부 확인**
- isna() : 데이터가 NaN인지 아닌지를 알려줌, DataFrame에 수행하면 모든 칼럼의 값이 NaN인지 아닌지를 True/False로 알려줌
  - 결손 데이터의 개수는 isna() 결과에 sum()함수를 추가해 구할 수 있음

In [35]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [36]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

####**fillna()로 결손 데이터 대체하기**
- 결손 데이터 다른 값으로 대체
- fillna()를 이용해 반환값을 다시 받거나 inplace=True를 추가해야 실제 데이터 세트 값이 변경됨

In [37]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S

In [38]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

###**apply lambda 식으로 데이터 가공**
- 판다스는 apply 함수에 lambda 식을 결합해 DataFrame이나 Series의 레코드별로 데이터를 가공하는 기능제공
- lambda 식
  - 다음과 같이 입력값의 제곱값을 구해서 반환하는 get_square(a)라는 함수가 있다고 가정
```
def get_square(a):
      return a**2
```
  - 함수명과 입력인자를 먼저 선언하고 이후 함수 내에서 입력 인자를 가공한 뒤 결과값을 return과 같은 문법으로 반환해야함
  - lambda는 이러한 함수의 선언과 함수 내의 처리를 한 줄의 식으로 쉽게 변환하는 식
```
lambda_square = lambda x : x**2
```
  - ':'로 입력 인자와 반환될 입력 인자의 계산식을 분리, 왼쪽에 입력인자, 오른쪽애 입력인자의 계산식 즉 반환값
  - lambda 식을 이용할 때 여러 개의 값을 입력 인자로 사용해야 할 경우에는 map()함수를 결합하여 사용
- 판다스 DataFrame의 lambda식은 파이선의 이러한 lambda식을 그대로 적용한 것
- if else 지원함, if 절의 경우 if 식보다 반환값을 먼저 기술, else의 경우는 else 식이 먼저 나오고 반환값이 나중에
- else if는 지원 안 함, else if를 사용하기 위해서는 else 절을 ()로 내포해 ()내에서 다시 if else 적용해야 함
- else if 가 많이 나오거나 switch case 문의 경우에는 아예 별도의 함수를 만드는 게 더 나을 수도 있음

In [39]:
a = [1,2,3]
squares = map(lambda x : x**2 ,a)
list(squares)

[1, 4, 9]

In [40]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [42]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age','Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [43]:
titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<= 60 else 'Elderly'))
titanic_df['Age_Cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_Cat, dtype: int64